Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27SOM1.svd
            <register>
               <name>TPR2</name>
               <description>Timing Parameter 2 Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>TXARD</name>
                     <description>Exit Active Power Down Delay to Read Command in Mode 'Fast Exit'</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXARDS</name>
                     <description>Exit Active Power Down Delay to Read Command in Mode 'Slow Exit'</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRPA</name>
                     <description>Row Precharge All Delay</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRTP</name>
                     <description>Read to Precharge</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TFAW</name>
                     <description>Four Active Windows</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPR</name>
               <description>Low-Power Register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>LPCB</name>
                     <description>Low-power Command Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LPCBSelect</name>
                        <enumeratedValue>
                           <name>NOLOWPOWER</name>
                           <description>Low-power feature is inhibited. No Powerdown, Self-refresh and Deep power modes are issued to the DDR-SDRAM device.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELFREFRESH</name>
                           <description>The MPDDRC issues a self-refresh command to the DDR-SDRAM device, the clock(s) is/are deactivated and the CKE signal is set low. The DDR-SDRAM device leaves the Self-refresh mode when accessed and reenters it after the access.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERDOWN</name>
                           <description>The MPDDRC issues a Powerdown command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the Powerdown mode when accessed and reenters it after the access.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEEPPOWERDOWN</name>
                           <description>The MPDDRC issues a Deep Powerdown command to the low-power DDR-SDRAM device.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLK_FR</name>
                     <description>Clock Frozen Command Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLK_FRSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Clock(s) is/are not frozen.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Clock(s) is/are frozen.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDDR2_LPDDR3_PWOFF</name>
                     <description>LPDDR2 - LPDDR3 Power Off Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LPDDR2_LPDDR3_PWOFFSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>No power-off sequence applied to LPDDR2/LPDDR3.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>A power-off sequence is applied to the LPDDR2/LPDDR3 device. CKE is forced low.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PASR</name>
                     <description>Partial Array Self-refresh</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Drive Strength</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DSSelect</name>
                        <enumeratedValue>
                           <name>DS_FULL</name>
                           <description>Full drive strength</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_HALF</name>
                           <description>Half drive strength</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_QUARTER</name>
                           <description>Quarter drive strength</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_OCTANT</name>
                           <description>Octant drive strength</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Time Between Last Transfer and Low-Power Mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TIMEOUTSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>SDRAM Low-power mode is activated immediately after the end of the last transfer.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DELAY_64_CLK</name>
                           <description>SDRAM Low-power mode is activated 64 clock cycles after the end of the last transfer.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DELAY_128_CLK</name>
                           <description>SDRAM Low-power mode is activated 128 clock cycles after the end of the last transfer.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>APDE</name>
                     <description>Active Power Down Exit Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>APDESelect</name>
                        <enumeratedValue>
                           <name>DDR2_FAST_EXIT</name>
                           <description>Fast Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR2_SLOW_EXIT</name>
                           <description>Slow Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPD_MR</name>
                     <description>Update Load Mode Register and Extended Mode Register</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>UPD_MRSelect</name>
                        <enumeratedValue>
                           <name>NO_UPDATE</name>
                           <description>Update of Load Mode and Extended Mode registers is disabled.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_SHAREDBUS</name>
                           <description>MPDDRC shares an external bus. Automatic update is done during a refresh command and a pending read or write access in the SDRAM device.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_NOSHAREDBUS</name>
                           <description>MPDDRC does not share an external bus. Automatic update is done before entering Self-refresh mode.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHG_FRQ</name>
                     <description>Change Clock Frequency During Self-refresh Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SELF_DONE</name>
                     <description>Self-refresh is done (read-only)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
