Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27SOM1.svd
            <register>
               <name>MD</name>
               <description>Memory Device Register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>MD</name>
                     <description>Memory Device</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MDSelect</name>
                        <enumeratedValue>
                           <name>LPDDR_SDRAM</name>
                           <description>Low-power DDR1-SDRAM</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR3_SDRAM</name>
                           <description>DDR3-SDRAM</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPDDR3_SDRAM</name>
                           <description>Low-power DDR3-SDRAM</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR2_SDRAM</name>
                           <description>DDR2-SDRAM</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPDDR2_SDRAM</name>
                           <description>Low-power DDR2-SDRAM</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>DBW_32_BITS</name>
                           <description>Data bus width is 32 bits</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBW_16_BITS</name>
                           <description>Data bus width is 16 bits.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WL</name>
                     <description>Write Latency (read-only)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WLSelect</name>
                        <enumeratedValue>
                           <name>WL_SETA</name>
                           <description>Write Latency Set A</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WL_SETB</name>
                           <description>Write Latency Set B</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RL3</name>
                     <description>Read Latency 3 Option Support (read-only)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RL3Select</name>
                        <enumeratedValue>
                           <name>RL3_SUPPORT</name>
                           <description>Read latency of 3 is supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL3_NOT_SUPPORTED</name>
                           <description>Read latency 0f 3 is not supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MANU_ID</name>
                     <description>Manufacturer Identification (read-only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision Identification (read-only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>DRAM Architecture (read-only)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TYPESelect</name>
                        <enumeratedValue>
                           <name>S4_SDRAM</name>
                           <description>4n prefetch architecture</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>S2_SDRAM</name>
                           <description>2n prefetch architecture</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NVM</name>
                           <description>Non-volatile device</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>S8_SDRAM</name>
                           <description>8n prefetch architecture</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DENSITY</name>
                     <description>Density of Memory (read-only)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DENSITYSelect</name>
                        <enumeratedValue>
                           <name>DENSITY_64MBITS</name>
                           <description>The device density is 64 Mbits.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_128MBITS</name>
                           <description>The device density is 128 Mbits.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_256MBITS</name>
                           <description>The device density is 256 Mbits.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_512MBITS</name>
                           <description>The device density is 512 Mbits.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_1GBITS</name>
                           <description>The device density is 1 Gbit.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_2GBITS</name>
                           <description>The device density is 2 Gbits.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_4GBITS</name>
                           <description>The device density is 4 Gbits.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_8GBITS</name>
                           <description>The device density is 8 Gbits.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_16GBITS</name>
                           <description>The device density is 16 Gbits.</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_32GBITS</name>
                           <description>The device density is 32 Gbits.</description>
                           <value>0x9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IO_WIDTH</name>
                     <description>Width of Memory (read-only)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>IO_WIDTHSelect</name>
                        <enumeratedValue>
                           <name>WIDTH_32</name>
                           <description>The data bus width is 32 bits.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WIDTH_16</name>
                           <description>The data bus width is 16 bits.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WIDTH_8</name>
                           <description>The data bus width is 8 bits.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_USED</name>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDDR23_LPR</name>
               <description>Low-power DDR2 Low-power DDR3 Low-power Register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>BK_MASK_PASR</name>
                     <description>Bank Mask Bit/PASR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SEG_MASK</name>
                     <description>Segment Mask Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Drive Strength</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DSSelect</name>
                        <enumeratedValue>
                           <name>DS_34_3</name>
                           <description>34.3 ohm typical</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_40</name>
                           <description>40 ohm typical (default)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_48</name>
                           <description>48 ohm typical</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_60</name>
                           <description>60 ohm typical</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_80</name>
                           <description>80 ohm typical</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_120</name>
                           <description>120 ohm typical</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDDR2_LPDDR3_DDR3_CAL_MR4</name>
               <description>Low-power DDR2 Low-power DDR3 and DDR3 Calibration and MR4 Register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>COUNT_CAL</name>
                     <description>LPDDR2 LPDDR3 and DDR3 Calibration Timer Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MR4_READ</name>
                     <description>Mode Register 4 Read Interval</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDDR2_LPDDR3_DDR3_TIM_CAL</name>
               <description>Low-power DDR2 Low-power DDR3 and DDR3 Timing Calibration Register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>ZQCS</name>
                     <description>ZQ Calibration Short</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RZQI</name>
                     <description>Built-in Self-Test for RZQ Information (read-only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RZQISelect</name>
                        <enumeratedValue>
                           <name>RZQ_NOT_SUPPORTED</name>
                           <description>RZQ self test not supported</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ZQ_VDDCA_FLOAT</name>
                           <description>The ZQ pin can be connected to VDDCA or left floating.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ZQ_SHORTED_GROUND</name>
                           <description>The ZQ pin can be shorted to ground.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ZQ_SELF_TEST_OK</name>
                           <description>ZQ pin self test complete; no error condition detected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IO_CALIBR</name>
               <description>I/O Calibration Register</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>RDIV</name>
                     <description>Resistor Divider, Output Driver Impedance</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RDIVSelect</name>
                        <enumeratedValue>
                           <name>RZQ_34</name>
                           <description>LPDDR2 serial impedance line = 34.3 ohms,DDR2/LPDDR1 serial impedance line: Not applicable</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_40_RZQ_38_RZQ_37_RZQ_35</name>
                           <description>LPDDR2 serial impedance line = 40 ohms,LPDDR3 serial impedance line = 38 ohms,DDR3 serial impedance line = 37 ohms,DDR2/LPDDR1 serial impedance line = 35 ohms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_48_RZQ_46_RZQ_44_RZQ_43</name>
                           <description>LPDDR2 serial impedance line = 48 ohms,LPDDR3 serial impedance line = 46 ohms,DDR3 serial impedance line = 44 ohms,DDR2/LPDDR1 serial impedance line = 43 ohms</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_60_RZQ_57_RZQ_55_RZQ_52</name>
                           <description>LPDDR2 serial impedance line = 60 ohms,LPDDR3 serial impedance line = 57 ohms,DDR3 serial impedance line = 55 ohms,DDR2/LPDDR1 serial impedance line = 52 ohms</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_80_RZQ_77_RZQ_73_RZQ_70</name>
                           <description>LPDDR2 serial impedance line = 80 ohms,LPDDR3 serial impedance line = 77 ohms,DDR3 serial impedance line = 73 ohms,DDR2/LPDDR1 serial impedance line = 70 ohms</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_120_RZQ_115_RZQ_110_RZQ_105</name>
                           <description>LPDDR2 serial impedance line = 120 ohms,LPDDR3 serial impedance line = 115 ohms,DDR3 serial impedance line = 110 ohms,DDR2/LPDDR1 serial impedance line = 105 ohms</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_CALIB</name>
                     <description>Enable Calibration</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EN_CALIBSelect</name>
                        <enumeratedValue>
                           <name>DISABLE_CALIBRATION</name>
                           <description>Calibration is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_CALIBRATION</name>
                           <description>Calibration is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TZQIO</name>
                     <description>IO Calibration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>CALCODEP</name>
                     <description>Number of Transistor P (read-only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CALCODEN</name>
                     <description>Number of Transistor N (read-only)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS</name>
               <description>OCMS Register</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>SCR_EN</name>
                     <description>Scrambling Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
