Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27SOM1.svd
            <register>
               <name>OCMS_KEY1</name>
               <description>OCMS KEY1 Register</description>
               <addressOffset>0x3C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY1</name>
                     <description>Off-chip Memory Scrambling (OCMS) Key Part 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS_KEY2</name>
               <description>OCMS KEY2 Register</description>
               <addressOffset>0x40</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>Off-chip Memory Scrambling (OCMS) Key Part 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONF_ARBITER</name>
               <description>Configuration Arbiter Register</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>ARB</name>
                     <description>Type of Arbitration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ARBSelect</name>
                        <enumeratedValue>
                           <name>ROUND</name>
                           <description>Round Robin</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NB_REQUEST</name>
                           <description>Request Policy</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANDWIDTH</name>
                           <description>Bandwidth Policy</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BDW_MAX_CUR</name>
                     <description>Bandwidth Max or Current</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P0</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P1</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P2</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P3</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P4</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P5</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P6</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P7</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P0</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P1</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P2</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P3</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P4</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P5</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P6</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P7</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P0</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P1</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P2</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P3</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P4</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P5</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P6</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P7</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMEOUT</name>
               <description>Timeout Register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>TIMEOUT_P0</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P1</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P2</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P3</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P4</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P5</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P6</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P7</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REQ_PORT_0123</name>
               <description>Request Port 0-1-2-3 Register</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>NRQ_NWD_BDW_P0</name>
                     <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P1</name>
                     <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P2</name>
                     <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P3</name>
                     <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REQ_PORT_4567</name>
               <description>Request Port 4-5-6-7 Register</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>NRQ_NWD_BDW_P4</name>
                     <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P5</name>
                     <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P6</name>
                     <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P7</name>
                     <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDW_PORT_0123</name>
               <description>Current/Maximum Bandwidth Port 0-1-2-3 Register</description>
               <addressOffset>0x54</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BDW_P0</name>
                     <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>BDW_P1</name>
                     <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>BDW_P2</name>
                     <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>BDW_P3</name>
                     <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDW_PORT_4567</name>
               <description>Current/Maximum Bandwidth Port 4-5-6-7 Register</description>
               <addressOffset>0x58</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BDW_P4</name>
                     <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BDW_P5</name>
                     <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BDW_P6</name>
                     <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BDW_P7</name>
                     <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RD_DATA_PATH</name>
               <description>Read Data Path Register</description>
               <addressOffset>0x5C</addressOffset>
               <fields>
                  <field>
                     <name>SHIFT_SAMPLING</name>
                     <description>Shift Sampling Point of Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SHIFT_SAMPLINGSelect</name>
                        <enumeratedValue>
                           <name>NO_SHIFT</name>
                           <description>Initial sampling point.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHIFT_ONE_CYCLE</name>
                           <description>Sampling point is shifted by one cycle.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHIFT_TWO_CYCLES</name>
                           <description>Sampling point is shifted by two cycles.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHIFT_THREE_CYCLES</name>
                           <description>Sampling point is shifted by three cycles, unique for LPDDR2 and DDR3 and LPDDR3.Not applicable for DDR2 and LPDDR1 devices.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
