Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27SOM1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RTC</name>
         <version>6056ZE</version>
         <description>Real-time Clock</description>
         <baseAddress>0xF80480B0</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SYSC</name>
            <description>System Controller Interrupt</description>
            <value>74</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <fields>
                  <field>
                     <name>UPDTIM</name>
                     <description>Update Request Time Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDCAL</name>
                     <description>Update Request Calendar Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVSEL</name>
                     <description>Time Event Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TIMEVSELSelect</name>
                        <enumeratedValue>
                           <name>MINUTE</name>
                           <description>Minute change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOUR</name>
                           <description>Hour change</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MIDNIGHT</name>
                           <description>Every day at midnight</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOON</name>
                           <description>Every day at noon</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CALEVSEL</name>
                     <description>Calendar Event Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CALEVSELSelect</name>
                        <enumeratedValue>
                           <name>WEEK</name>
                           <description>Week change (every Monday at time 00:00:00)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MONTH</name>
                           <description>Month change (every 01 of each month at time 00:00:00)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YEAR</name>
                           <description>Year change (every January 1 at time 00:00:00)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <fields>
                  <field>
                     <name>HRMOD</name>
                     <description>12-/24-hour Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERSIAN</name>
                     <description>PERSIAN Calendar</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UTC</name>
                     <description>UTC Time Format</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NEGPPM</name>
                     <description>NEGative PPM Correction</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CORRECTION</name>
                     <description>Slow Clock Correction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HIGHPPM</name>
                     <description>HIGH PPM Correction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT0</name>
                     <description>All ADC Channel Trigger Event Source Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OUT0Select</name>
                        <enumeratedValue>
                           <name>NO_WAVE</name>
                           <description>No waveform, stuck at '0'</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ1HZ</name>
                           <description>1 Hz square wave</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ32HZ</name>
                           <description>32 Hz square wave</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ64HZ</name>
                           <description>64 Hz square wave</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ512HZ</name>
                           <description>512 Hz square wave</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_TOGGLE</name>
                           <description>Output toggles when alarm flag rises</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_FLAG</name>
                           <description>Output is a copy of the alarm flag</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROG_PULSE</name>
                           <description>Duty cycle programmable pulse</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUT1</name>
                     <description>ADC Last Channel Trigger Event Source Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OUT1Select</name>
                        <enumeratedValue>
                           <name>NO_WAVE</name>
                           <description>No waveform, stuck at '0'</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ1HZ</name>
                           <description>1 Hz square wave</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ32HZ</name>
                           <description>32 Hz square wave</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ64HZ</name>
                           <description>64 Hz square wave</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ512HZ</name>
                           <description>512 Hz square wave</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_TOGGLE</name>
                           <description>Output toggles when alarm flag rises</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_FLAG</name>
                           <description>Output is a copy of the alarm flag</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROG_PULSE</name>
                           <description>Duty cycle programmable pulse</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>THIGH</name>
                     <description>High Duration of the Output Pulse</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>THIGHSelect</name>
                        <enumeratedValue>
                           <name>H_31MS</name>
                           <description>31.2 ms</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_16MS</name>
                           <description>15.6 ms</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_4MS</name>
                           <description>3.91 ms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_976US</name>
                           <description>976 us</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_488US</name>
                           <description>488 us</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_122US</name>
                           <description>122 us</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_30US</name>
                           <description>30.5 us</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_15US</name>
                           <description>15.2 us</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TPERIOD</name>
                     <description>Period of the Output Pulse</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TPERIODSelect</name>
                        <enumeratedValue>
                           <name>P_1S</name>
                           <description>1 second</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_500MS</name>
                           <description>500 ms</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_250MS</name>
                           <description>250 ms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_125MS</name>
                           <description>125 ms</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMR</name>
               <description>Time Register</description>
               <addressOffset>0x08</addressOffset>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>Current Second</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>MIN</name>
                     <description>Current Minute</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HOUR</name>
                     <description>Current Hour</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>AMPM</name>
                     <description>Ante Meridiem Post Meridiem Indicator</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMR_UTC_MODE_MODE</name>
               <description>Time Register</description>
               <alternateRegister>TIMR</alternateRegister>
               <addressOffset>0x08</addressOffset>
               <fields>
                  <field>
                     <name>UTC_TIME</name>
                     <description>Current UTC Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALR</name>
               <description>Calendar Register</description>
               <addressOffset>0x0C</addressOffset>
               <fields>
                  <field>
                     <name>CENT</name>
                     <description>Current Century</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>YEAR</name>
                     <description>Current Year</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MONTH</name>
                     <description>Current Month</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DAY</name>
                     <description>Current Day in Current Week</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DATE</name>
                     <description>Current Day in Current Month</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMALR</name>
               <description>Time Alarm Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>Second Alarm</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SECEN</name>
                     <description>Second Alarm Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MIN</name>
                     <description>Minute Alarm</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>MINEN</name>
                     <description>Minute Alarm Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HOUR</name>
                     <description>Hour Alarm</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>AMPM</name>
                     <description>AM/PM Indicator</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HOUREN</name>
                     <description>Hour Alarm Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMALR_UTC_MODE_MODE</name>
               <description>Time Alarm Register</description>
               <alternateRegister>TIMALR</alternateRegister>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>UTC_TIME</name>
                     <description>UTC_TIME Alarm</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALALR</name>
               <description>Calendar Alarm Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>MONTH</name>
                     <description>Month Alarm</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>MTHEN</name>
                     <description>Month Alarm Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATE</name>
                     <description>Date Alarm</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DATEEN</name>
                     <description>Date Alarm Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALALR_UTC_MODE_MODE</name>
               <description>Calendar Alarm Register</description>
               <alternateRegister>CALALR</alternateRegister>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>UTCEN</name>
                     <description>UTC Alarm Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
