Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27SOM1.svd
            <register>
               <name>CA0R</name>
               <description>Capabilities 0 Register</description>
               <addressOffset>0x40</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TEOCLKF</name>
                     <description>Timeout Clock Frequency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TEOCLKU</name>
                     <description>Timeout Clock Unit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BASECLKF</name>
                     <description>Base Clock Frequency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAXBLKL</name>
                     <description>Max Block Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MAXBLKLSelect</name>
                        <enumeratedValue>
                           <name>_512</name>
                           <description>512 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024</name>
                           <description>1024 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2048</name>
                           <description>2048 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ED8SUP</name>
                     <description>8-Bit Support for Embedded Device</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADMA2SUP</name>
                     <description>ADMA2 Support</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSSUP</name>
                     <description>High Speed Support</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMASUP</name>
                     <description>SDMA Support</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRSUP</name>
                     <description>Suspend/Resume Support</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>V33VSUP</name>
                     <description>Voltage Support 3.3V</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>V30VSUP</name>
                     <description>Voltage Support 3.0V</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>V18VSUP</name>
                     <description>Voltage Support 1.8V</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SB64SUP</name>
                     <description>64-Bit System Bus Support</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASINTSUP</name>
                     <description>Asynchronous Interrupt Support</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLTYPE</name>
                     <description>Slot Type</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CA1R</name>
               <description>Capabilities 1 Register</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>SDR50SUP</name>
                     <description>SDR50 Support</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDR104SUP</name>
                     <description>SDR104 Support</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDR50SUP</name>
                     <description>DDR50 Support</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRVASUP</name>
                     <description>Driver Type A Support</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRVCSUP</name>
                     <description>Driver Type C Support</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRVDSUP</name>
                     <description>Driver Type D Support</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCNTRT</name>
                     <description>Timer Count For Retuning</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TSDR50</name>
                     <description>Use Tuning for SDR50</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTMOD</name>
                     <description>Retuning Modes</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RTMODSelect</name>
                        <enumeratedValue>
                           <name>MODE1</name>
                           <description>Timer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE2</name>
                           <description>Timer and Retuning Request</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE3</name>
                           <description>Auto Retuning (for transfer) Timer and Retuning Request</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKMULT</name>
                     <description>Clock Multiplier</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCCAR</name>
               <description>Maximum Current Capabilities Register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>MAXCUR33V</name>
                     <description>Maximum Current for 3.3V</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAXCUR30V</name>
                     <description>Maximum Current for 3.0V</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAXCUR18V</name>
                     <description>Maximum Current for 1.8V</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FERACES</name>
               <description>Force Event Register for Auto CMD Error Status</description>
               <addressOffset>0x50</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ACMD12NE</name>
                     <description>Force Event for Auto CMD12 Not Executed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDTEO</name>
                     <description>Force Event for Auto CMD Timeout Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDCRC</name>
                     <description>Force Event for Auto CMD CRC Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDEND</name>
                     <description>Force Event for Auto CMD End Bit Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDIDX</name>
                     <description>Force Event for Auto CMD Index Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDNI</name>
                     <description>Force Event for Command Not Issued by Auto CMD12 Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEREIS</name>
               <description>Force Event Register for Error Interrupt Status</description>
               <addressOffset>0x52</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CMDTEO</name>
                     <description>Force Event for Command Timeout Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDCRC</name>
                     <description>Force Event for Command CRC Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDEND</name>
                     <description>Force Event for Command End Bit Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDIDX</name>
                     <description>Force Event for Command Index Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATTEO</name>
                     <description>Force Event for Data Timeout error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATCRC</name>
                     <description>Force Event for Data CRC error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATEND</name>
                     <description>Force Event for Data End Bit Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CURLIM</name>
                     <description>Force Event for Current Limit Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMD</name>
                     <description>Force Event for Auto CMD Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADMA</name>
                     <description>Force Event for ADMA Error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOOTAE</name>
                     <description>Force Event for Boot Acknowledge Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESR</name>
               <description>ADMA Error Status Register</description>
               <addressOffset>0x54</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRST</name>
                     <description>ADMA Error State</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LMIS</name>
                     <description>ADMA Length Mismatch Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASAR0</name>
               <description>ADMA System Address Register 0</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>ADMASA</name>
                     <description>ADMA System Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>2</dimIncrement>
               <name>PVR[%s]</name>
               <description>Preset Value Register 0 (for initialization)</description>
               <addressOffset>0x60</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>SDCLKFSEL</name>
                     <description>SDCLK Frequency Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CLKGSEL</name>
                     <description>Clock Generator Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRVSEL</name>
                     <description>Driver Strength Select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SISR</name>
               <description>Slot Interrupt Status Register</description>
               <addressOffset>0xFC</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>INTSSL</name>
                     <description>Interrupt Signal for Each Slot</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCVR</name>
               <description>Host Controller Version Register</description>
               <addressOffset>0xFE</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SVER</name>
                     <description>Specification Version Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>VVER</name>
                     <description>Vendor Version Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APSR</name>
               <description>Additional Present State Register</description>
               <addressOffset>0x200</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>HDATLL</name>
                     <description>DAT[7:4] High Line Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MC1R</name>
               <description>e.MMC Control 1 Register</description>
               <addressOffset>0x204</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>CMDTYP</name>
                     <description>e.MMC Command Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDTYPSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>The command is not an e.MMC specific command.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAITIRQ</name>
                           <description>This bit must be set to 1 when the e.MMC is in Interrupt mode (CMD40). Refer to 'Interrupt Mode' in the 'Embedded MultiMedia Card (e.MMC) Electrical Standard 4.51' .</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STREAM</name>
                           <description>This bit must be set to 1 in the case of Stream Read(CMD11) or Stream Write (CMD20). Only effective for e.MMC up to revision 4.41.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOOT</name>
                           <description>Starts a Boot Operation mode at the next write to SDMMC_CR. Boot data are read directly from e.MMC device.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDR</name>
                     <description>e.MMC HSDDR Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPD</name>
                     <description>e.MMC Open Drain Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOOTA</name>
                     <description>e.MMC Boot Acknowledge Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTN</name>
                     <description>e.MMC Reset Signal</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCD</name>
                     <description>e.MMC Force Card Detect</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MC2R</name>
               <description>e.MMC Control 2 Register</description>
               <addressOffset>0x205</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SRESP</name>
                     <description>e.MMC Abort Wait IRQ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABOOT</name>
                     <description>e.MMC Abort Boot</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
