Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D27SOM1.svd
            <register>
               <name>ACR</name>
               <description>AHB Control Register</description>
               <addressOffset>0x208</addressOffset>
               <fields>
                  <field>
                     <name>BMAX</name>
                     <description>AHB Maximum Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BMAXSelect</name>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>The maximum burst size is INCR16.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>The maximum burst size is INCR8.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>The maximum burst size is INCR4.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Only SINGLE transfers are performed.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC2R</name>
               <description>Clock Control 2 Register</description>
               <addressOffset>0x20C</addressOffset>
               <fields>
                  <field>
                     <name>FSDCLKD</name>
                     <description>Force SDCLK Disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC1R</name>
               <description>Retuning Timer Control 1 Register</description>
               <addressOffset>0x210</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>TMREN</name>
                     <description>Retuning Timer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TMRENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>The retuning timer is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The retuning timer is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC2R</name>
               <description>Retuning Timer Control 2 Register</description>
               <addressOffset>0x211</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RLD</name>
                     <description>Retuning Timer Reload</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCVR</name>
               <description>Retuning Timer Counter Value Register</description>
               <addressOffset>0x214</addressOffset>
               <fields>
                  <field>
                     <name>TCVAL</name>
                     <description>Retuning Timer Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTISTER</name>
               <description>Retuning Timer Interrupt Status Enable Register</description>
               <addressOffset>0x218</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>TEVT</name>
                     <description>Retuning Timer Event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TEVTSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The TEVT status flag in SDMMC_RTISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The TEVT status flag in SDMMC_RTISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTISIER</name>
               <description>Retuning Timer Interrupt Signal Enable Register</description>
               <addressOffset>0x219</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>TEVT</name>
                     <description>Retuning Timer Event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TEVTSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>No interrupt is generated when the TEVT status rises in SDMMC_RTISTR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>An interrupt is generated when the TEVT status rises in SDMMC_RTISTR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTISTR</name>
               <description>Retuning Timer Interrupt Status Register</description>
               <addressOffset>0x21C</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>TEVT</name>
                     <description>Retuning Timer Event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTSSR</name>
               <description>Retuning Timer Status Slots Register</description>
               <addressOffset>0x21D</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TEVTSLOT</name>
                     <description>Retuning Timer Event Slots</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TUNCR</name>
               <description>Tuning Control Register</description>
               <addressOffset>0x220</addressOffset>
               <fields>
                  <field>
                     <name>SMPLPT</name>
                     <description>Sampling Point</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CACR</name>
               <description>Capabilities Control Register</description>
               <addressOffset>0x230</addressOffset>
               <fields>
                  <field>
                     <name>CAPWREN</name>
                     <description>Capabilities Write Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALCR</name>
               <description>Calibration Control Register</description>
               <addressOffset>0x240</addressOffset>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>PADs Calibration Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>Calibration Clock Division</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ALWYSON</name>
                     <description>Calibration Analog Always ON</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUNDIS</name>
                     <description>Calibration During Tuning Disabled</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BPEN</name>
                     <description>Calibration Bypass Enabled</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNTVAL</name>
                     <description>Calibration Counter Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CALN</name>
                     <description>Calibration N Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CALNBP</name>
                     <description>Calibration N Bypass Value</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CALP</name>
                     <description>Calibration P Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CALPBP</name>
                     <description>Calibration P Bypass Value</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
